#Love Metr
a = input("Сиздин атыныз: ")
f = int(input("Сиздин жашыныз: "))
b = input("Сиздин суйгонунздун аты: ")
l = int(input("Суйгонунздун жашы: "))
a = a.title()
n1 = f - l
n2 = l - f
if a == "Абдурахман" or a == "Abdurahman":
    print("Cен далбаеб педик суйууго ээ боло албайсын гот лох акмак ")
elif n1 <= 3 and n1 >= 0:
    j = "98%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n1 >= 4 and n1 < 8:
    j = "87%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n1 >= 8 and n1 < 18:
    j = "65%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n1 >= 18:
    j = "32%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n2 <= 3 and n1 > 0:
    j = "83%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n2 >= 4 and n1 < 8:
    j = "71%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n2 >= 8 and n1 < 18:
    j = "53%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
elif n2 >= 18:
    j = "11%"
    print("Урматтуу " + a + " менен " + b + ", сиздердин суйуунуздор: " + j)
